In [2]:
import pandas as pd

In [3]:
e_data = pd.read_csv("https://www.dropbox.com/s/u2xupuhf07y85zh/earthQuake.csv?dl=1")
density_data = pd.read_csv("https://www.dropbox.com/s/p6ejr4mzx8pjq9m/population_density_long.csv?dl=1")
population_data=pd.read_csv("https://www.dropbox.com/s/bp5hb61zrui2qo6/population_total_long.csv?dl=1")

separate the date into columns

In [125]:
e_data[['Month','Day','Year']]=e_data['Date'].str.split('/',-1,expand=True)

get rid of all unwanted columns (is Depth usefull?)

In [126]:
e_data = e_data.drop(['Date','Time','ID','Source','Location Source','Magnitude Source','Status','Type','Magnitude Type'],axis=1)

In [122]:
e_data

       Latitude  Longitude   Depth  Magnitude Month Day  Year
0       19.2460   145.6160  131.60        6.0    01  02  1965
1        1.8630   127.3520   80.00        5.8    01  04  1965
2      -20.5790  -173.9720   20.00        6.2    01  05  1965
3      -59.0760   -23.5570   15.00        5.8    01  08  1965
4       11.9380   126.4270   15.00        5.8    01  09  1965
...         ...        ...     ...        ...   ...  ..   ...
23407   38.3917  -118.8941   12.30        5.6    12  28  2016
23408   38.3777  -118.8957    8.80        5.5    12  28  2016
23409   36.9179   140.4262   10.00        5.9    12  28  2016
23410   -9.0283   118.6639   79.00        6.3    12  29  2016
23411   37.3973   141.4103   11.94        5.5    12  30  2016

[23412 rows x 7 columns]

  Country Name  Year    Count
0        Aruba  1960    54211
1  Afghanistan  1960  8996973
2       Angola  1960  5454933
3      Albania  1960  1608800
4      Andorra  1960    13411